{
  "sections": [
    {
      "section_number": "2",
      "title": "",
      "subsections": [
        {
          "section_number": "2.1.2",
          "title": "Admission",
          "content": "tion. I wish you all to complete your degree program successfully in applied science, applying your knowledge and abilities toward the scientific innovations and sustainable development of the nation. Good luck! Dr.(Mrs.)J.Nimalan Dean Faculty of Applied Science v Contents",
          "page_start": 5
        }
      ],
      "content": "",
      "page_start": 5
    },
    {
      "section_number": "1",
      "title": "General Information",
      "subsections": [
        {
          "section_number": "1.1",
          "title": "Introduction",
          "content": "Appendices Detailed Syllabi 67 Appendices Contact Details 244 The Vavuniya Campus of the University of Jaffna was established on 1st April 1997 by an order made under Section 22 of the Universities Act No. 16 of 1978 with two faculties, namely, the Faculty of Applied Science and the Faculty of Business Studies. The Faculty of Technological Studies was established in February 2020 (No. 2160/43 order under section 27(1), Universities Act No. 16 of 1978) by the Ministry of Higher Education, Technology and Innovation of Sri Lanka. The Vavuniya Campus of the University of Jaffna was then elevated to a separate state university and established as the ”University of Vavuniya, Sri Lanka” by an extraordinary gazette issued on June 8, 2021. Accordingly, the University of Vavuniya became the 17th state University in Sri Lanka with effective from 1st August 2021. The permanent site of the University of Vavuniya is about ten kilometres away from Vavuniya in the Vavuniya-Mannar road at Sopalapuliyankulam, Pampaimadu. One hundred and sixty acres of land was allocated and reserved for the construction of academic, administrative, and residential buildings. Vavuniya, in the southern part of the Northern Province, is a melting pot of cultures from the Vanni region and the north-central region of Sri Lanka. A culture that has been influenced and shaped by the Vanniyas (of whom the King Pandaravanniyan is a prominent example). This district has ties even with the Paduvankarai regions that extend to the Southernmost part of the Northern and Eastern provinces an indication of how the Vanniya people have contributed to the rich culture of the Tamil speaking societies of Sri Lanka. Vavuniya is renowned for its mild climate, which provides a pleasant change from the usual arid conditions of the coastal regions of the Northern and Eastern provinces. As such, it provides an ideal setting for the Faculty of Applied Science, with a pleasant environment to indulge in educational and extra-curricular activities. Further, as per present conditions, Vavuniya provides a strategic location that acts as a transit point for the movement of people as well as various financial and industrial activities/processes. Thus, Vavuniya is expected to grow into a prominent financial and cultural hub in Sri Lanka. The Faculty of Applied Science as an academic organization has a flexible, friendly, and conducive internal environment that allows for effective teaching, learning, and research. This is due to the fact that the faculty has a unique signatured culture where the student and staff interactions are high-level and one-to-one attention is administered to the students by the teachers. Further, the faculty has very strong ties with the community of Vavuniya and it is seen as a key and prominent player in the advisory capacities of all development endeavours taking place in the locality. The Faculty of Applied Science of the University of Vavuniya",
          "page_start": 7
        },
        {
          "section_number": "1.2",
          "title": "Officers of the University of Vavuniya",
          "content": "coursework, practical sessions, industrial training, and research projects. The Information and gramme in 2018. The department has been offering the course units for the Bachelor of Science in Applied Mathematics and Computing, Bachelor of Science Honours in Computer Science, Bachelor of Science in Information Technology, and Bachelor of Science Honours in visionin2018. TherevisedcurriculaareinlinewiththeOutcomeBasedEducationandLearner Centered Teaching (OBE-LCT), Sri Lanka Qualification Framework (SLQF), IEEE/ACM, and Subject Benchmark Statements of IT (SBS-IT) guidelines. Chancellor Dr.S.Mohanadas Vice Chancellor Prof.T.Mangaleswaran Dean/Applied Science Dr.(Mrs.)J.Nimalan Dean/Business Studies Prof.Y.Nanthagoban Dean/Technological Studies Mr.V.Senthooran Registrar Mr.N.Rajavisahan Bursar Mr.L.Ramramanan",
          "page_start": 7
        },
        {
          "section_number": "1.3",
          "title": "Academic Staff of the Library",
          "content": "Senior Assistant Librarian/Library Mr.S.Shanmugathasan",
          "page_start": 7
        },
        {
          "section_number": "1.4",
          "title": "Executive Staff",
          "content": "Deputy Registrar/Establishments Mr.K.Poheenthiran Deputy Registrar/Examinations and Admissions Mr.M.Ganeshalingam Deputy Registrar/Academic Affairs and Mr.M.Nanthakumar Publication Branch Assistant Registrar/Students and Welfare Division Mr.R.Jeyakumar Assistant Registrar/Administration Ms.T.Piranavamalar Assistant Registrar/Faculty of Applied Science Ms.K.Anusiga Assistant Registrar/Faculty of Business Studies Ms.P.Danoshana Assistant Registrar/Faculty of Technological Studies Mr.P.Krishnanathan Assistant Bursar/Accounts and supplies Mr.B.Balathas Assistant Bursar/Payments Mr.A.E.M.Venesious Works Engineer Eng.G.Thanushan Curator (Landscape) Mr.T.Raguram",
          "page_start": 7
        },
        {
          "section_number": "1.6.1",
          "title": "Office of the Dean",
          "content": "Dean Dr.(Mrs.)J.Nimalan BScHons (Agri) (Jaffna,SL), MSc (AIT,Thailand), PhD (Peradeniya,SL) Assistant Registrar Ms.K.Anusiga BBAHons (FM) (Jaffna,SL), MSc in Applied Finance (USJ,SL) Management Assistant Mr.P.Mohanakanth",
          "page_start": 7
        },
        {
          "section_number": "1.6.2",
          "title": "Department of Bio-science",
          "content": "Science Honours in Environmental Science. The abbreviation of Bachelor of Science Honours",
          "page_start": 7
        },
        {
          "section_number": "1.6.3",
          "title": "Department of Physical Science",
          "content": "Head Dr.S.Kirushanth BScHons (ICT) (Jaffna,SL), MSc (Peradeniya,SL), PhD (Cape Town,RSA) Academic Staff Mr.S.Kuhanesan BScHons (Physics) (Peradeniya,SL), MPhil (Peradeniya,SL) Mr.S.Thirukumaran BScHons (Computer Science) (Jaffna,SL), PGDip (Colombo,SL), MEngSc (Malaya,Malaysia), SEDA Mr.B.Yogarajah BScHons (Mathematics) (Jaffna,SL), PGDip (Peradeniya,SL), MPhil (Jaffna,SL) Dr.R.Nagulan BSc (Jaffna,SL), MSc (Peradeniya,SL), PhD (Kent,UK) Mr.S.S.Suthaharan BCA (Madras,India), MSc (Madras,India), MPhil (Peradeniya,SL) PhD (Reading) Mrs.R.Yasotha BScHons (Computer Science) (Jaffna,SL), MPhil (Jaffna,SL) Mr.T.Jeyamugan BScHons (AMC) (Jaffna,SL), MSc (Moratuwa,SL) Mr.N.Edwin Linosh BScHons (AMC) (Jaffna,SL), MSc (Moratuwa,SL) Mr.S.Thilaganathan BScHons (Mathematics) (EUSL,SL), PGDip (Peradeniya,SL), MPhil (Peradeniya,SL) PhD (Reading) Dr.S.Kirushanth BScHons (ICT) (Jaffna,SL), MSc (Peradeniya,SL), PhD (Cape Town,RSA)",
          "page_start": 7
        },
        {
          "section_number": "1.7",
          "title": "Faculty Quality Assurance Cell (FQAC)",
          "content": "Faculty Quality Assurance Cell is functioning at the faculty level to ensure that the quality and standards of the academic programmes offered by the Faculty to meet the changing demands and challenges of higher education sector. The objective of this FQAC is to provide suggestions or recommendations and facilitation to implement and monitor the best management practices to ensure quality principles at the facultylevelforaneffectivelearningenvironmentaccordingtotheSLQFguidelinesandrelevant benchmarks, student and staff support services, and other various aspects. FQAC conducts regular meetings with the members to discuss quality aspects, faculty awards and Dean’s list, conducts students’ feedback and satisfaction surveys, analyzes the results, and communicates with the appropriate staff members for verification and acceptance. Furthermore, FQAC takes a significant role in facilitating institutional and program reviews and undertakes follow-up actions on the recommendations given during the above reviews and finally reports to the Faculty Board for decision making. The meeting minutes and documentation are regularly updated on the FQAC official website linked to CQA and ensuring transparency, accountability, affordability, and accessibility to both staff and students, and adding value to the Faculty of Applied Science. Best practices show the path to success through continuous improvement, leading to the benchmark of excellence. 2. Degree Programme – Department of Bio-science",
          "page_start": 7
        }
      ],
      "content": "",
      "page_start": 7
    },
    {
      "section_number": "4",
      "title": "Examination Rules",
      "subsections": [
        {
          "section_number": "2.1.2",
          "title": "Admission",
          "content": "candidatewhodisregardstheseinstructionswillbeconsideredashavingwrittennotesoroutline of answers with the intension of copying. 4.13 Unwanted parts of Answers to be crossed out Any answer or part of answer which is not to be considered for the purpose of assessment shall be neatly crossed out. If the same questions have been attempted in more than one place the answer or answers that are not to be counted shall be neatly crossed out. 4.14 Supervisors Authority Candidates are under the authority of the Supervisor and shall assist him/her by carrying out his/her instructions and those of his/her Invigilators, during the examination and immediately before and after it. 4.15 Conduct Every candidate shall conduct himself/herself in the Examination Hall and its precincts so as not to cause disturbance or inconvenience to the Supervisor or his/her staff or to other candidates. In entering and leaving the hall, shall conduct him/her as quietly as possible. A candidate is liable to be executed from the examination hall for disorderly conduct. 4.16 Stopping work Candidates shall stop work promptly when ordered by the Supervisor/Invigilator to do so. 4.17 Maintenance of Silence Absolute silence shall be maintained in the examination hall and its precincts. A candidate is not permitted for any reason whatsoever to communicate or have any dealings with any person other than the Supervisor/Invigilator. In case of urgent necessity the candidate may communicate with the Supervisor/Invigilator. The attention of the Supervisor/Invigilator shall be drawn by raising his hand from where he is seated. 4.18 Leaving During the course of answering a paper no candidate shall be permitted to leave the examination hall temporarily. In case of an emergency, the Supervisor/Invigilator will grant permission to do so but the candidate will be under his surveillance.",
          "page_start": 65
        },
        {
          "section_number": "1.5",
          "title": "University Medical Officer",
          "content": "should be submitted to the Deputy Registrar/Examination within 14 days of the conclusion of the examination. 4.28 Plagiarism The Faculty operates on a zero tolerance policy when it deals with acts of plagiarism. The students are advised to ensure that all their course work, reports and other reportive work are referenced properly when quoting or citing from another person’s work. Of particular importance is the common tendency to ’copy and paste’ from the internet that is practiced voraciously at present. This, in the case of the Faculty of Applied Science will not be tolerated even to the very minor levels.",
          "page_start": 69
        }
      ],
      "content": "",
      "page_start": 8
    },
    {
      "section_number": "5",
      "title": "Services and Facilities",
      "subsections": [
        {
          "section_number": "2.1.2",
          "title": "Admission",
          "content": "The office of the Deputy Registrar (Examinations and Admission) is located in the Main Campus Building at Pampaimadu. This office carries out Students Registration, Issuing IdenStatements and, Degree Certificates. The office of the Marshal and Assistant Registrar (Welfare) is located in Pampaimadu premises. All the needs of the students outside their study courses such as loan facilities, grants, scholarships, hostel facilities, cafeterias are provided through the Welfare Branch. 5.1 Financial Assistance Financial Assistances available are as follows: (cid:136) Mahapola Scheme (cid:136) Bursary Scheme (cid:136) Vice Chancellor welfare fund (cid:136) Late Mrs. Puvaneswary Loganathan Memorial fund 5.2 Awards and Prizes TheFacultyofAppliedSciencestudentsareeligibletoapplyforthefollowingawards. However, the students must satisfy the minimum requirements to apply for these awards. (cid:136) Faculty Award (cid:136) Late Mrs. Puvaneswary Loganathan Memorial Gold Medal",
          "page_start": 71
        },
        {
          "section_number": "1.6.3",
          "title": "Department of Physical Science",
          "content": "ing, learning and research activities. Cisco Networking laboratory and Electronic laboratory have been established to teach advanced course modules and for research activities. The",
          "page_start": 72
        },
        {
          "section_number": "1.6.2",
          "title": "Department of Bio-science",
          "content": "Environmental Biology related course modules. The department has begun establishing a computer laboratory to accommodate more IT based course modules under the environmental science curriculum. 5.5 Self Access Learning Centre There is a Self Access Learning Centre with computers and internet facilities at the Faculty of Applied Science. The students can utilize this learning centre to enhance their knowledge and independent learning. 5.6 IT Centre The IT Centre of the University of Vavuniya is located in Pampaimadu premises. There are 50 computers available with internet facilities for teaching, learning and training purposes. Further, the centre supports to train the state and non-state employees and school leavers in IT and other aspects. The students of the Faculty of Applied Science also can enjoy the facilities of this centre. 5.7 Library Services TheUniversitypossessesawellestablishedlibrarytosupporttheteaching,learningandresearch in all disciplines. It is situated in the Park Road premises and Pampaimadu premises. Further, the library also provides facilities that enable students to access scientific information through selected online journals. The detail of available books can be browsed through Online Public Access Catalogue (OPAC). 65 5.8 Physical Education Students are encouraged to participate and utilize the facilities available for sports in the University. The Physical Education Unit is located in Pampaimadu Hostel premises having a cricket playground where we can partially used for Football and Volleyball. Further an indoor stadium with badminton court , netball court and a gymnasium is available for students and staff. The physical education unit organizes Inter Faculty meets, Freshers meet, Big Matches, and Open Tournaments annually. 5.9 Accommodation and Lodging At present University of Vavuniya has four hostels in order to accommodate 1000 students both male and female. 5.10 Facilities for the differently abled students The Faculty has the ramp facility in the laboratories to support the differently abled students. In addition to that lecture halls are equipped with left-handed arm chairs. Further, Faculty is taking initiative to construct washrooms and elevators for the differently abled students. 5.11 Health Facilities The University Health Centre is established to help the students of the University to lead an",
          "page_start": 72
        },
        {
          "section_number": "1.5",
          "title": "University Medical Officer",
          "content": "centres of the Main Campus at Park Road and Pampaimadu Premises during the office hours. University students are entitled for free consultations and medicine from the Health Centre. 5.12 Student Union and Societies The students’ union of faculty of Applied Science represents the entire undergraduate student community of the faculty. The students’ union organizes many events with the participation of all the students and the faculty administration. There are other student societies in the Faculty of Applied Science. These include ENSOC, ITCS, and IEEE Student Branch. Many events such as workshops and competitions are conducted through these student societies with the approval of the authorities. 5.13 Staff and Students Interaction A committee has been set up to promote staff and students interaction. This committee arranges various programmes to enhance togetherness and social harmony.",
          "page_start": 73
        }
      ],
      "content": "",
      "page_start": 8
    },
    {
      "section_number": "A",
      "title": "AMC and Computer Science",
      "subsections": [
        {
          "section_number": "2.3.1",
          "title": "Evaluation Methods",
          "content": "The members of the evaluation panel for the final oral presentation are appointed by the head of the department with the approval of the Faculty Board. The daily diary is evaluated by the industrial supervisor. The final report is evaluated by the academic supervisor. Daily diary 30% Final Report 40% Oral Presentation 30% Appendix B Detailed Syllabus",
          "page_start": 76
        },
        {
          "section_number": "1.1",
          "title": "Introduction",
          "content": "[2] W.C Booth, G.G Colomb, and J.M. Williams, The Craft of Research. University of Chicago Press, 2003. 123 Course Code CSH4226 Course Title Industrial Training Credit Value 06 (600 notional hours) Objective To provide opportunities for students to apply the computing knowledge, develop and consolidate practical computing skills, and develop an understanding of the relevant profession and to promote cooperation and to develop synergetic collaboration between industry and the university in promoting a knowledgeable society. Intended Learning Outcomes (cid:136) improve their self-confidence and computing skills (cid:136) develop their negotiation, leadership and teamwork skills (cid:136) describe the management and business practices, the responsibilities of an employee, ethical issues and operational safety (cid:136) apply learning methods such as design and problem solving to develop technical, interpersonal and communication skills, both oral and written Contents The student will be allocated an industrial supervisor. In addition, a academic supervisor will be appointed by the department. The student visits the relevant industry to discuss with the industrial supervisor about any project or assignment/tasks. They try to learn the systems objectives, organization, administrative process, progress of ongoing projects, problems faced by, practical issues if any, etc. in the industry. They record all the work done and knowledge gained by maintaining a Daily Diary. The academic supervisor will provide ongoing support to the student. The academic supervisor will visit typically two to three times during the training period to ensure that the training objectives are being met and that progress is satisfactory. Teaching and Learning Methods There are no mandatory formal teaching arrangements for this module: however it is normally expected that the host company will provide appropriate training as may be required to support the student during their work. The students should communicate the assigned academic supervisor every week via email to discuss the progress. Students are expected to demonstrate quantifiable understanding and personal development both during and at the conclusion of the placement.",
          "page_start": 78
        }
      ],
      "content": "",
      "page_start": 8
    },
    {
      "section_number": "B",
      "title": "Environmental Science",
      "subsections": [
        {
          "section_number": "1.1",
          "title": "Introduction",
          "content": "Software). USA: High Performance Systems Inc. Wainwright, J. and Mulligan, M. (2004) Environmental Modelling. John Wiley & Sons, Ltd.",
          "page_start": 11
        },
        {
          "section_number": "1.6.3",
          "title": "Department of Physical Science",
          "content": "(cid:136) Bachelor of Science in Applied Mathematics and Computing (cid:136) Bachelor of Science Honours in Computer Science (cid:136)",
          "page_start": 11
        },
        {
          "section_number": "2.1.2",
          "title": "Admission",
          "content": "Students are admitted annually to the degree programme by the University Grant Commission with the following minimum requirement: At least ‘S’ grades in Biology, Chemistry, and in one of the following subjects at the GCE Advanced Level examination; (cid:136) Agricultural Science (cid:136) Higher Mathematics (cid:136) Mathematics (cid:136) Combined Mathematics (cid:136) Physics",
          "page_start": 19
        },
        {
          "section_number": "2.1.4",
          "title": "Program Overview",
          "content": "This study program is designed to offer theoretical knowledge, practical skills, problem solving, andcreativethinking. Thecourseunitsaredistributedatfourlevels–Level1, 2, 3, and4. The proposed study program is credit based and an academic year is divided into two semesters, each with 15 weeks duration. One credit shall constitute 50 notional learning hours. Contents in a theory course may consist of one credit (50 notional learning hours), 2 credits (100 notional learning hours), and 3 credits (150 notional learning hours) while a practical course 11",
          "page_start": 19
        },
        {
          "section_number": "1.6.2",
          "title": "Department of Bio-science",
          "content": "a. successfullycompletedminimum90creditsofcorecourseunitsduringthestudyprogramme in Levels 1, 2, and 3, b. obtained Grade ‘C’ or above in the Auxiliary Course Units English Language I and English Language II, c. obtained Grade ‘D+’ or above in the Auxiliary course units other than English Language I and English Language II, d. obtained a minimum OGPA of 2.00 in Level 1, 2 and 3, and e. completed the above relevant requirements within the period of 5 academic years.",
          "page_start": 20
        },
        {
          "section_number": "2.1.6",
          "title": "Volume of Learning",
          "content": "units offered during four years of study. It should be noted that Grade ‘C’ or above in the auxiliary course units English Language I and English Language II, and Grade ‘D+’ or above in the other auxiliary course units are mandatory to complete the degree programme. During Level 4 Semester II, students shall be required to carry out a research project for one semester duration on a given topic under the supervision of a senior academic in a state university or senior research staff from a reputed research institute. Students have to undergo an industrial training for two months full-time considered as one credit.",
          "page_start": 20
        },
        {
          "section_number": "2.1.5",
          "title": "Credit Valued Course Unit System",
          "content": "Credit System All the course units are assigned credit values. One credit is considered to be 50 notional learning hours. Code Numbers Each course unit will be denoted by a four-digit number. As stated in Figure 2.1, the first digit denotes the level/year of study. The second digit indicates the semester. The third digit",
          "page_start": 20
        },
        {
          "section_number": "2.1",
          "title": "The Structure of the Programme",
          "content": "indicates the serial number of the course unit in the specific semester and the fourth digit indicates the number of credits assigned to the course unit. Figure 2.1: Details of a Course Code Core Course Unit The core course units are designed in such a way to provide skills in communication, teamwork, leadership, creativity, problem solving, managerial and entrepreneurial skills, data analysis, IT applications for environmental management, social networking, adaptability, and flexibility to the undergraduates. The majority of the course units are designed by incorporating practical sessions. Except for one practical course unit, the rest of them are either theoretical course",
          "page_start": 21
        },
        {
          "section_number": "2.1.7",
          "title": "Opting for General Degree",
          "content": "During the fourth year of study, a student following an honours degree programme may opt for a general degree before the submission of the thesis of the research project with valid reason. The final acceptance to opt for the general degree will be subjected to the recommendation of the Faculty Board of Applied Sciences and the Senate. If a student wishes to complete his/her studies in three years, he/she has to complete a minimum of 90 credits of core course units and 14 credits of auxiliary course units during three years of study to obtain the degree titled Bachelor of Science in Environmental Science.",
          "page_start": 22
        },
        {
          "section_number": "2.2.2",
          "title": "Graduate Profile",
          "content": "The Department of Bio-science, Faculty of Applied Science produces the graduates with a strong sense of commitment to the acquisition of updated knowledge, skills, and an ability to apply these to a dynamic environment. They can critically evaluate science in a real-world context through exposure to industries and act with integrity and fluency across cultures and perspectives for the betterment of society. They will have intellectual openings to engage in research and be innovative through independent learning to meet the necessary requirements. They will possess teamwork spirit, positive attitude, and the ability of effective communication and leadership quality.",
          "page_start": 23
        },
        {
          "section_number": "2.3",
          "title": "Evaluation System of the Degree Programme",
          "content": "(cid:136) A candidate fails to sit the examination without giving valid reasons acceptable by the Faculty Board and the Senate, he/she shall be considered as forfeiting a chance to sit that examination and will be given grade ‘E’ for the End-semester Examination of that course unit. (cid:136) The highest grade awarded to the candidate resitting the course unit is ‘C’. (cid:136) A student who obtains a grade ‘C–’ for a course unit may also resit for the End-semester Examination of that course unit in order to improve his/her grade. If a student obtains a lower grade while resitting, he/she is entitled to keep the previous grade. (cid:136) A student will not be allowed to resit a course unit more than two times. Thus, a student can sit for a course unit at a maximum of three times. (cid:136) The maximum duration for completing the Bachelor of Science in Honours in Environmental Science degree programme shall be six academic years. This would exclude periods of absence caused by medical or other valid reasons acceptable by the Faculty Board and the Senate. Provision for Re-scrutinization The Commission Circular No: 978 dated 9th April, 2012 on “Provision for re-scrutinization of marks and grades of undergraduates” has been adopted by the Faculty with effect from 6th February 2013. However, the candidate who apply for re-scrutiny should accept the final grade which may be higher, lower or no-change after the re-scrutinization.",
          "page_start": 25
        },
        {
          "section_number": "2.3.1",
          "title": "Evaluation Methods",
          "content": "Theory: In-course Assessment (Tutorials/Assignments) 10% In-course Assessment (Quiz I and II) 20% End-semester Examination (Theory) 70% Practical: In-course Assessment (Field visits and reports) 100% Final marks = {(5×Theory)+(1×Practical)}/6 References Auld, B.A. and Kim, K.U. (1996) Weed Managemnet in Rice. 1st Ed. UK: Oxford and IBH Publishing Pvt. Ltd. Appendix C Detailed Syllabus",
          "page_start": 25
        },
        {
          "section_number": "2.3.2",
          "title": "Grading system and Grade Point Average (GPA)",
          "content": "Based on the scheme of evaluation stated above, marks obtained in respect of a course unit will be graded as follows. Table 2.2: Grade point values for the range of marks Range of Grade Grade Point Value Marks 80 — 100 A+ 4.0 75 — 79 A 4.0 70 — 74 A– 3.7 65 — 69 B+ 3.3 60 — 64 B 3.0 55 — 59 B– 2.7 50 — 54 C+ 2.3 45 — 49 C 2.0 40 — 44 C– 1.7 35 — 39 D+ 1.3 30 — 34 D 1.0 00 — 29 E 0.0 The minimum grade to pass a course unit will be ‘C–’. Grade Point Average (GPA) is the credit-weighted arithmetic mean of the Grade Points which is formulated as (cid:80) Sum of (credits ×grade points) c g i i GPA = = (cid:80) Total credits c i Where c is the number of credits for the ith course and g is the grade point for the ith course. i i The Overall GPA (OGPA) for the degree programme would be the credit weighted mean giving equal weight for all levels, computed and rounded to two decimals.",
          "page_start": 27
        },
        {
          "section_number": "2.3.3",
          "title": "Examination Process",
          "content": "(a) In-course Assessments: In-course Assessments of any course unit will be carried out during the academic session of that course unit. The dates and times for the In-course Assessments will be determined by the lecturer-in-charge of that course unit. The grades scored by a student in various components of In-course Assessment of any course unit shall be brought to the notice of the students by the lecturer concerned of the course unit. In-course assessments of any course unit or a component of a course unit shall be carried out during the lecture delivery period of that course unit. (b) End-semester Examinations: End-semester Examination shall be conducted for each course unit at the end of the semester as indicated in the academic calendar approved by the faculty board. All the arrangements for the End-semester Examination shall be made by the Examination branch of the University of Vavuniya. The date and time of the examinations shall be decided at the beginning of each semester by the Dean in consultation with the Heads of Departments. The faculty level pre-examination board",
          "page_start": 27
        },
        {
          "section_number": "2.3.4",
          "title": "Award of Degree",
          "content": "Award of Honours Degree (SLQF Level 6) A student deemed to have satisfied the requirement for the award of Bachelor of Science",
          "page_start": 29
        },
        {
          "section_number": "2.3.5",
          "title": "Award of Classes",
          "content": "iners based on the following criteria: First Class: A student shall be awarded First Class if he/she",
          "page_start": 30
        },
        {
          "section_number": "2.3.7",
          "title": "Effective Date of the Degree",
          "content": "The effective date of a degree programme for a student shall be the last date of final Endsemester Examination.",
          "page_start": 32
        }
      ],
      "content": "",
      "page_start": 8
    },
    {
      "section_number": "C",
      "title": "Information Technology",
      "subsections": [
        {
          "section_number": "2.1.2",
          "title": "Admission",
          "content": "(cid:136) The abbreviations of the Bachelor of Science in Applied Mathematics and Computing degree and the Bachelor of Science Honours in Computer Science degree are BSc (Applied Mathematics and Computing) and BScHons (Computer Science) respectively. respectively. Bachelor of Science in Applied Mathematics and Computing Students are admitted annually to the programmes by the University Grants Commission from the GCE Advanced Level Physical Science stream.",
          "page_start": 37
        },
        {
          "section_number": "1.6.3",
          "title": "Department of Physical Science",
          "content": "Level 3 Bachelor of Science Honours in Computer Science Level 3 Semester 1 Course Course Title Credits Theory Practical Code Hours Hours AMA3122 Optimization II 2 30 CSC3112 Computer Graphics 2 30 CSC3123 Operating Systems 3 30 30 CSC3132 Web Application Development 2 60 CSH3143 Knowledge Representation and 3 30 30 Programming in Logic CSH3153 Human Computer Interaction 3 30 30 CSH3163 Advanced Database System 3 45 ACU3112 Career Guidance 2 30 Level 3 Semester 2 Course Course Title Credits Theory Practical Code Hours Hours CSC3213 Computer Architecture 3 30 30 CSC3222 Graph Theory 2 30 CSH3242 Theory of Computation 2 30 CSH3254 Parallel Computing 4 45 30 CSH3263 Advanced Computer Networks 3 45 CSH3273 Artificial Intelligence 3 45 ACU3212 Management and Entrepreneurial 2 30 Skills ACU3222 Research Methodology and Scientific 2 30 Writing",
          "page_start": 38
        },
        {
          "section_number": "3.1.4",
          "title": "Programmes Overview",
          "content": "The degree programmes follow a semester based course unit system. As such, each academic year is considered as level 1, 2, 3, and 4 respectively. Each level of study is divided into two semesters, semester 1 and semester 2. The duration of a semester is sixteen weeks, with a one week mid-semester vacation nearly halfway through the semester. The Bachelors degree programmes encompass six semesters (three consecutive academic years), whereas the Honours degree programmes consist of eight semesters (four consecutive academic years). Each course unit carries a credit value that defines contact hours for that course unit. The student should satisfy the credit requirement of a minimum of 90 credits of core course units at the end of the sixth semester for the award of Bachelors Degree and a minimum of 120 credits of core course units at the end of the eighth semester for the award of Honours Degree. In addition, the students are requested to complete 16 credits in auxiliary course units. Initially, students would be admitted to a Bachelors degree programme (6 semesters), and a selected number of students will be admitted to follow the Honours degree (8 semesters) based on their performance.",
          "page_start": 38
        },
        {
          "section_number": "2.1.5",
          "title": "Credit Valued Course Unit System",
          "content": "A course unit is a subject module that has a credit value. A credit is a time based quantitative measure assigned to course units on the basis of number of contact hours. Each course unit consists of a theory component or a practical component or theory and practical components together. Intheorycourseunits, 15hoursoflecturesisconsideredasonecreditandinpractical",
          "page_start": 38
        },
        {
          "section_number": "3.1",
          "title": "Structure of the Degree Programmes",
          "content": "of the course unit in the specific semester of the subject area, and the number of credit values assigned to the course unit respectively.",
          "page_start": 39
        },
        {
          "section_number": "3.1.6",
          "title": "Selection to the Honours Degree Programmes",
          "content": "Bachelor of Science Honours in Computer Science: The students who aspire to follow the honours degree programme in Computer Science are required to apply after the completion of level 2. Each student selected to follow the honours degree programme has to complete 120 creditscorecourseunits(includinga6creditsResearchProject)duringthefouracademicyears of study. Industrial training course unit (6 credits) and auxiliary course units (16 credits) are also offered for the honours degree students. The courses for the honours degree programme commence from semester 1 of level 3. The requirements for selection to the Honours in Computer Science degree programme are as follows: (cid:136) Obtaining Grade ‘C-’ or above in all the core course units (60 credits) offered in level 1 and level 2, (cid:136) ObtainingGrade‘C’oraboveintheauxiliarycourseunitsEnglishLanguageIandEnglish Language II and Grade ‘D+’ or above in the auxiliary course units other than English Language I and English Language II offered in level 1 and level 2, and (cid:136) Obtaining an Overall Grade Point Average (OGPA) of not less than 3.00 for the course units offered in level 1 and level 2. Bachelor of Science Honours in Information Technology: At the end of level 3, the students are required to apply for the Honours degree programme. Based on the academic performance of levels 1, 2, and 3, the selected number of students will be allowed to follow the honours degree programme. Each student selected to follow the honours degree programme has to complete 120 credits core course units (including a 6 credit Research Project) during the four academic years of study. Industrial training course unit (6 credits) and auxiliary course units (16 credits) are also offered for the honours degree students. The requirements",
          "page_start": 41
        },
        {
          "section_number": "3.1.7",
          "title": "Opting for Bachelors Degree",
          "content": "During the fourth year of study, a student following an honours degree programme may opt for a three-year bachelor’s degree before the submission of the thesis of the research project with valid reason. The final acceptance to opt for the bachelor degree will be subjected to the recommendation of the Faculty Board of Applied Science and the approval of the Senate.",
          "page_start": 41
        },
        {
          "section_number": "3.2.1",
          "title": "Programmes Objectives",
          "content": "Bachelor of Science in Applied Mathematics and Computing/Bachelor of Science Honours in Computer Science: The primary objective of the Applied Mathematics and Computing degree is to provide students who are better able to do problem-solving in the technical fields that require skills in both analytical mathematics and computer science. The main objective of the honours degree program in Computer Science is to provide students with the foundations that support both a successful career path in computing as well as offer appropriate qualifications for further degree work in computer science-related disciplines. Specific objectives of the degree programmes (cid:136) To provide interdisciplinary qualifications to allow students to compete successfully for themanyindustrialpositionsthatcallforstrongmathematicsbackgroundssupplemented by good computing skills. (cid:136) To possess theoretical and practical knowledge of computer science sufficient to earn a living and contribute to the economic development of the nation. (cid:136) To prepare for advanced education in computer science and software engineering. (cid:136) To provide a wide-ranging set of qualities such as deep knowledge in the subjects, excellence in research, strong sense of intellectual integrity, ethics, creative thinking power, self-directed learning, and active citizenship. Bachelor of Science in Information Technology/Bachelor of Science Honours in Information Technology: The main goal of this degree programme is to provide students a",
          "page_start": 42
        },
        {
          "section_number": "3.2",
          "title": "Degree Programmes Objectives and Graduate Profiles",
          "content": "(cid:136) inculcates effective communication and soft skills in teamwork with social awareness globally showing leadership and entrepreneurship and exhibit good citizenship.",
          "page_start": 43
        },
        {
          "section_number": "3.2.2",
          "title": "Graduate Profiles",
          "content": "Bachelor of Science in Applied Mathematics and Computing/Bachelor of Science Honours in Computer Science: A graduate of the degree programmes should have the below mentioned qualities. Academic and research excellence (cid:136) acquire deep knowledge in the subject areas. (cid:136) analyze complex problems and design, develop and evaluate solutions. (cid:136) develop skills in writing, presentation, and communication. (cid:136) develop skills on designing, implementing and reporting of scientific investigations. (cid:136) apply mathematical and computer science algorithms and tools to solve problems using intellectual abilities. (cid:136) internalize strong personal and professional ethics and etiquette. High employability, personality development, and active citizenship (cid:136) work cooperatively and effectively in multi-disciplinary teams. (cid:136) be self-motivated, enthusiastic and undertake lifelong learning to continue professional development. (cid:136) take leadership and responsibilities. (cid:136) discuss issues of national importance. (cid:136) nurture independence of mind and intellectual integrity. (cid:136) be socially responsible and respect cultures and values of others. Bachelor of Science in Information Technology/Bachelor of Science Honours in",
          "page_start": 43
        },
        {
          "section_number": "3.2.3",
          "title": "Career Prospects",
          "content": "Bachelor of Science in Applied Mathematics and Computing: The main aim of this program is to provide students with a comprehensive tertiary-level education in Applied Mathematics, Computer Science and related areas of learning to produce competent graduates. The graduates of the degree programmes have proven their calibre as professionals in public sectors as well as in private sectors such as teaching, banking field, IT professionals, etc.. The graduates can choose the academic career path and proceed to further studies for master or PhD degrees. Bachelor of Science Honours in Computer Science: There is high demand nationally and internationally from industry, organizations and research centres for software engineers, data scientists, artificial intelligence researchers, systems analysts and technical consultants. ComputerScienceisthefastestdevelopingfieldintheworld, andtherequirementforgraduates with the skills to work in this field is continuing to grow. The graduates can continue their studies at postgraduate level, studying a field of computer science in greater detail through an MSc, MPhil or PhD. Further study is essential for a career in academia and can be useful for a range of other careers. Bachelor of Science in Information Technology/Bachelor of Science Honours in Information Technology: The present era pushes the state and private institutions towards digital management. It is necessary to produce more graduates with IT discipline to cater the",
          "page_start": 44
        },
        {
          "section_number": "3.3",
          "title": "Evaluation System of the Degree Programmes",
          "content": "Second Class (Upper Division): A student shall be awarded Second Class (Upper Division) if he/she a. is eligible for Bachelor of Science in Applied Mathematics and Computing Degree, b. obtains minimum OGPA of 3.30, and c. completes the relevant requirements within three academic years. Second Class (Lower Division): A student shall be awarded Second Class (Lower Division) if he/she a. is eligible for Bachelor of Science in Applied Mathematics and Computing Degree, b. obtains minimum OGPA of 3.00, and c. completes the relevant requirements within three academic years. Bachelor of Science Honours in Computer Science",
          "page_start": 45
        },
        {
          "section_number": "2.3.1",
          "title": "Evaluation Methods",
          "content": "(cid:136) In-Course Assessments 30% (cid:136) End-Semester Examination 70% Recommended Readings 1. Tara Dixon & Martin O’hara, Communication Skills: University of Ulster, 2010 2. HelioFredGarcia,ThePowerofCommunication: SkillstoBuildTrust,InspireLoyalty, and Lead Effectively, 2012. 3. Ellis, R, Communication Skills: Stepladders to success for the Professional, 2002 4. Barun K. Mitra, Personality Development and Soft Skills, 2011 213 LEVEL 3 Course Title: Knowledge Based Systems and Logic Programming Course Code IT3113 Credit Value 3 (30h Theory + 30h Practical + 90h Independent learning) Objective To provide knowledge on various techniques of knowledge-based representation and logic programming. Intended Learning Outcomes (cid:136) represent knowledge in various forms (cid:136) explain the necessary techniques of Artificial Intelligence (cid:136) develop knowledge-based systems by defining inference engines (cid:136) make use of predicate logic for theorem proving (cid:136) apply problem-solving techniques for intelligent systems (cid:136) solve logic-based problems using logic programming. Contents Knowledge representation: Predicate logic, Rules, Semantic nets, Frames, Scripts, Theorem proving, Expert Systems: Introduction, Anatomy, Types, Case Studies, Fuzzy logic: Fuzzy set, Fuzzy Controllers, Membership Functions, Fundamental of Artificial Intelligence: Turing test, Chinese Room Arguments, Four School Thoughts, Searching Techniques: Uniformed Search, A*, BFS, DFS, Classic AI Problems: River crossing, Water Jug, Monkey and banana, Dog and balls, Logic programming: Basic concepts, Syntactic and semantic description. Practical: Implementation of logical concepts and theorem proving using Prolog. Teaching and Learning Methods Classroom lectures, self-learning and presentation, computer practical demonstration and training. Evaluation Method Theory: In-Course Assessments 30% and End Semester Examination 70% Practical: In-Course Assessments 40% and End Semester Examination 60% Final Marks = (2×Theory +1×Practical)/3 Recommended Readings 1. R. Akerkar, P. Sajja,Knowledge-Based Systems, 2010. 2. Stuart Russell and Peter Norvig, Artificial Intelligence: A Modern Approach, Global Edition, 2011 3. Max Bramer, Logic Programming with Prolog 2nd Edition, 2013 4. William F. Clocksin and Christopher S. Mellish, Programming in Prolog: Using the ISO Standard,5th edition, 2013 5. Ivan Bratco, Prolog Programming for Artificial Intelligence, 3rdEdition, 2001.",
          "page_start": 45
        },
        {
          "section_number": "3.3.2",
          "title": "Grading System and Grade Point Average",
          "content": "Based on the scheme of evaluation mentioned above, final grade obtained in respect of a course unit is illustrated in Table 3.2. The minimum grade to pass a core course unit is ‘C-’. For a core course unit with theory and practical components, the student should obtain a minimum ’C-’ grade in each component to pass the course unit. The lowest grade of the component is given for the course unit if a component is failed. Grade Point Average (GPA) for each level is the credit-weighted arithmetic mean of the Grade Point Values which is formulated as (cid:80) (c ×g ) i i GPA = (cid:80) c i where c i is the number of credits for the ith course unit and g i is the grade point value for the ith course unit. Any calculated GPA is rounded to the two decimal places. The Overall GPA (OGPA) for the degree programmes would be the credit weighted mean giving equal weight for all levels (three levels for three-year bachelor degree and four levels for honours degree), computed to two decimal places.",
          "page_start": 46
        },
        {
          "section_number": "2.3.3",
          "title": "Examination Process",
          "content": "In-Course Assessments In-course assessments of any course unit or a component of a course unit shall be carried out during the lecture delivery period of that course unit. The dates and time for the in-course assessments shall be determined by the lecturer in-charge of that course unit. The grades of the in-course assessments of any course unit shall be displayed on the notice board by the Head of the Department to enable the students to know the grade. End Semester Examinations An End Semester Examination shall be conducted for each course unit at the end of the semesterinwhichtheteachingofthecourseunitiscompleted. Theendsemesterexaminations shall be conducted by the Examination Branch of the University of Vavuniya. The date and time of the end semester examinations shall be decided at the beginning of each semester by the Dean in consultation with the Heads of Departments. The Faculty Level Examination Board shall finalise the results of a course unit subject to the approval of Senate. The finalised result (grade) of a course unit (or components) shall be displayed on the notice board by the Dean of the faculty. The Dean shall send the Grades List to the Examination Branch along with detailed mark sheets. When the results of the examinations on all the course units of a particular semester of an academic year are received by the Examination Branch, the Examination Branch will summon a meeting of the Examination Board chaired by the Vice-Chancellor. The Board will release the results of the students in that Level of that academic year giving the GPA scored by the students. The Examination Board chaired by the Vice-Chancellor will also release the awards of Degrees with the Overall GPA (OGPA) and the Class obtained by the students who have completed the degree programmes in an academic year.",
          "page_start": 47
        },
        {
          "section_number": "3.3.4",
          "title": "Award of Degrees",
          "content": "Bachelor of Science in Applied Mathematics and Computing (SLQF Level 5) A student deemed to have satisfied the requirement for the award of ”Bachelor of Science in Applied Mathematics and Computing” degree, if he/she has; a. obtained Grade ‘C-’ or above in 90 credits of core course units offered in level 1, level 2, and level 3 of the degree programme, b. obtained Grade ‘C’ or above in the auxiliary course units English Language I and English Language II, and Grade ‘D+’ or above in the auxiliary course units other than English Language I and English Language II, c. obtained a minimum OGPA of 2.00, and d. completed the relevant requirements within a period of five academic years. Bachelor of Science Honours in Computer Science (SLQF Level 6) A student deemed to have satisfied the requirement for the award of ”Bachelor of Science Honours in Computer Science” degree, if he/she has; a. obtained Grade ‘C-’ or above in 120 credits of core course units offered in level 1, level 2, level 3, and level 4 of the degree programme, b. obtained Grade ‘C’ or above in the auxiliary course units English Language I and English Language II and Grade ’D+’ or above in the auxiliary course units other than English Language I and English Language II,",
          "page_start": 49
        },
        {
          "section_number": "2.3.5",
          "title": "Award of Classes",
          "content": "Board of Examiners based on the following criteria: First Class: A student shall be awarded First Class if he/she",
          "page_start": 50
        },
        {
          "section_number": "3.3.6",
          "title": "Award of Diploma/Higher Diploma",
          "content": "Applied Mathematics and Computing A student who wishes to leave the degree programme after completing the level 1 or level 2 is advised to make a request to the faculty board. The Diploma/Higher Diploma in Applied Mathematics and Computing will be awarded after the approval of the Senate. Award of Diploma (SLQF Level 3) A student deemed to have satisfied the requirement for the award of ”Diploma in Applied Mathematics and Computing” degree, if he/she has; a. obtained Grade ‘C-’ or above in all the core course units (30 credits) offered in level 1, b. obtained Grade ‘C’ or above in the auxiliary course unit English Language I and Grade ‘D+’ or above in the auxiliary course units other than English Language I offered in level 1, and c. obtained a minimum GPA of 2.00 in level 1. Award of Higher Diploma (SLQF Level 4) A student deemed to have satisfied the requirement for the award of ”Higher Diploma in Applied Mathematics and Computing” degree, if he/she has; a. obtained grade ‘C-’ or above in all the core course units (60 credits) offered in level 1 and level 2, b. obtained grade ‘C’ or above in the auxiliary course units English Language I and English Language II and Grade ‘D+’ or above in the auxiliary course units other than English Language I and English Language II offered in level 1 and 2, and c. obtained a minimum OGPA of 2.00.",
          "page_start": 53
        },
        {
          "section_number": "2.4",
          "title": "Curriculum Layout",
          "content": "Level 4 Bachelor of Science Honours in Computer Science Level 4 Semester 1 Course Course Title Credits Theory Practical Code Hours Hours CSH4112 System Analysis and Design 2 30 CSH4123 Bioinformatics 3 30 30 CSH4133 Digital Image Processing 3 45 CSH4144 Machine Learning 4 45 30 CSH4152 Cryptography 2 30 CSH4162 Compiler Design 2 30 CSH4173 Numerical Linear Algebra and Finite 3 45 Element Method Level 4 Semester 2 CSH4216 Research Project 6 600 notional hours CSH4226 Industrial Training 6 600 notional hours Note: The Research Project course unit will be carried out throughout the level four and it is evaluated at the end of the level four.",
          "page_start": 55
        },
        {
          "section_number": "1.1",
          "title": "Introduction",
          "content": "2. Mahmoud A. Al-Qutayri, Smart Home Systems, InTech, 2010 3. Gerard Meijer, Kofi Makinwa, Mchiel Pertijs, Smart Sensor Systems: Emerging Technologies and Applications, 1st Edition, 2014 243 Course Title Software Defined Networking Course Code EL4192 Credit Value 2 (30h Theory + 70h Independent learning) Objective To provide knowledge on main concepts, architectures and Internet architectural framework of Software Defined Networking (SDN). Intended Learning Outcomes (cid:136) compare various planes used in SDN. (cid:136) demonstrate the concepts and applications of OpenFlow protocol. (cid:136) identify the specific architectures used in SDN. (cid:136) make use of SDN techniques in large data centers and Internet exchange. (cid:136) illustrate traffic engineering concepts in SDN scenarios. Contents Plane Separation: Control Plane and Data Plane, IETF Forces, Active Networking. Concepts, Advantages and Disadvantages, OpenFlow Protocol: Concepts, Applications, Manipulation Techniques. Network Virtualization Framework: SDN Controllers. Switching and Firewall Implementation using SDN Concepts. Software-based and Hardware-based, Programmable Network Hardware. Data Centers: Internet Exchange Points, Backbone Networks, Home Networks, Traffic Engineering. Teaching and Learning Methods Classroom lectures, self-learning & discussion. Evaluation Method (cid:136) In-Course Assessments 30% (cid:136) End-Semester Examination 70% Recommended Readings 1. Thomas D. Nadeau and Ken Gray, “SDN: Software Defined Networks, An Authoritative Review of Network Programmability Technologies”, O’Reilly Media, 2013. 2. Siamak Azodolmolky, “Software Defined Networking with OpenFlow”, Packt publishing, 2013. 3. PaulGoransson, ChuckBlack, andTimothyCulver, “SoftwareDefinedNetworks: A Comprehensive Approach”, Morgan Kaufmann, 2nd Edition, 2016. Contact Details Vice Chancellor 024 222 2264 Registrar 024 222 2265 Bursar 024 222 2265 Dean/Applied Science 024 222 0179 Dean/Business Studies 024 222 8231 Dean/Technological Studies 024 222 8240 Senior Assistant Librarian/Library 024 222 0279 Deputy Registrar/Establishments 024 222 5143 Deputy Registrar/Examinations and Admissions 024 222 3317 Assistant Registrar/Students and Welfare Division 024 222 8238 Assistant Registrar/Administration 024 222 3316 Assistant Registrar/Faculty of Applied Science 024 222 8401 Assistant Registrar/Faculty of Business Studies 024 222 8232 Assistant Bursar/Accounts and supplies 024 222 0299 Assistant Bursar/Payments 024 222 4017 Works Engineer 024 222 8237",
          "page_start": 55
        },
        {
          "section_number": "1.5",
          "title": "University Medical Officer",
          "content": "Faculty of Applied Science Website https://fas.vau.ac.lk/ Virtual Learning Environment (VLE) https://vle.fas.vau.ac.lk 244",
          "page_start": 252
        }
      ],
      "content": "",
      "page_start": 8
    }
  ],
  "metadata": {
    "source": "/home/shaminda/Documents/My_Projects/uov_FAS_handbook_bot/data/raw/Hand-Book-Fas-2021-2022.pdf",
    "extracted_at": "2025-07-10T12:34:55.246325",
    "total_pages": 252
  }
}