{
    "section_number": "1",",
    "section name": "General Information",",
    "title": "1.1 Introduction",",
    "content": "The Vavuniya Campus of the University of Jaffna was established on 1st April 1997 by an order made under Section 22 of the Universities Act No. 16 of 1978 with two faculties, namely, the Faculty of Applied Science and the Faculty of Business Studies. The Faculty of Technological Studies was established in February 2020 (No. 2160/43 order under section 27(1), Universities Act No. 16 of 1978) by the Ministry of Higher Education, Technology and Innovation of Sri Lanka. The Vavuniya Campus of the University of Jaffna was then elevated to a separate state university and established as the ”University of Vavuniya, Sri Lanka” by an extraordinary gazette issued on June 8, 2021. Accordingly, the University of Vavuniya became the 17th state University in Sri Lanka with effective from 1st August 2021. The permanent site of the University of Vavuniya is about ten kilometres away from Vavu- niya in the Vavuniya-Mannar road at Sopalapuliyankulam, Pampaimadu. One hundred and sixty acres of land was allocated and reserved for the construction of academic, administrative, and residential buildings. Vavuniya, in the southern part of the Northern Province, is a melting pot of cultures from the Vanni region and the north-central region of Sri Lanka. A culture that has been influenced and shaped by the Vanniyas (of whom the King Pandaravanniyan is a prominent example). This district has ties even with the Paduvankarai regions that extend to the Southernmost part of the Northern and Eastern provinces - an indication of how the Vanniya people have contributed to the rich culture of the Tamil speaking societies of Sri Lanka. Vavuniya is renowned for its mild climate, which provides a pleasant change from the usual arid conditions of the coastal regions of the Northern and Eastern provinces. As such, it provides an ideal setting for the Faculty of Applied Science, with a pleasant environment to indulge in educational and extra-curricular activities. Further, as per present conditions, Vavuniya provides a strategic location that acts as a transit point for the movement of people as well as various financial and industrial activities/processes. Thus, Vavuniya is expected to grow into a prominent financial and cultural hub in Sri Lanka. The Faculty of Applied Science as an academic organization has a flexible, friendly, and conducive internal environment that allows for effective teaching, learning, and research. This is due to the fact that the faculty has a unique signatured culture where the student and staff interactions are high-level and one-to-one attention is administered to the students by the teachers. Further, the faculty has very strong ties with the community of Vavuniya and it is seen as a key and prominent player in the advisory capacities of all development endeavours taking place in the locality. The Faculty of Applied Science of the University of Vavuniya consists of two departments, namely the Department of Physical Science and the Department of Bio-science." ,",
    "page": "1",
    "section number": "1",",
    "section name": "General Information-Department of Bio Science",",
    "title": "1.1 Introduction",",
    "content": "The Department of Bio-science is one of the departments in the Faculty of Applied Science of the University of Vavuniya, commenced in 1997. The Department of Bio-science offers the course units for the bachelors degree programme in Environmental Science. The Syllabi has been drafted with different courses in Environmental Science with an emphasis on fields of technological importance. The major objective of the department is to train the undergraduates to suit the latest trends in the industry, research, and development of the national economy through course work, practical sessions, industrial training, and research projects pertaining to Environmental Science. The revised curriculum has been approved by the Council and the UGC. The curriculum was revised in such a way to offer the Bachelor of Science Honours in Environmental Science as a four-year honours degree program, in line with the Outcome Based Education and Learner Centered Teaching (OBE-LCT) and Sri Lanka Qualifications Framework (SLQF).",",
    "page": "2",
    "section number": "1",",
    "section name": "General Information-Department of Physical Science",",
    "title": "1.1 Introduction",",
    "content": "The Department of Physical Science of University of Vavuniya came into existence with the commencement of the Faculty of Applied Science in 1997. Initially, the department offered the course units for a degree programme named Applied Mathematics and Computing. Then the Information and Communication Technology Degree programme was introduced in 2006 for all streams of advanced level students. The Applied Mathematics and Computing Degree programme was also revised and the three-year degree programme named Applied Mathematics and Computing and the four-year degree programme named Computer Science. The major commitment of the department is to provide up-to-date knowledge in Mathemat- ics and Statistics, Computer Science, and Information Technology to undergraduates through coursework, practical sessions, industrial training, and research projects. The Information and Communication Technology programme was revised as Information Technology degree pro- gramme in 2018. The department has been offering the course units for the Bachelor of Science in Applied Mathematics and Computing, Bachelor of Science Honours in Computer Science, Bachelor of Science in Information Technology, and Bachelor of Science Honours in Information Technology from the academic year 2017/18 onwards based on the curriculum re- vision in 2018. The revised curricula are in line with the Outcome Based Education and Learner Centered Teaching (OBE-LCT), Sri Lanka Qualification Framework (SLQF), IEEE/ACM, and Subject Benchmark Statements of IT (SBS-IT) guidelines.",",
    "page": "3",
    "section number": "1",",
    "section name": "General Information-Department of Bio Science",",
    "title": "1.2 Officiers of the University of Vavuniya",",
    "content": "{",
    "university_leadership": "[ {",
    "position": "Chancellor",",
    "name": "Dr. S. Mohanadas",
    "position": "Vice Chancellor",",
    "name": "Prof. T. Mangaleswaran",
    "position": "Dean/Applied Science",",
    "name": "Dr.(Mrs.) J. Nimalan",
    "position": "Dean/Business Studies",",
    "name": "Prof. Y. Nanthagoban",
    "position": "Dean/Technological Studies",",
    "name": "Mr. V. Senthooran",
    "position": "Registrar",",
    "name": "Mr. N. Rajavisahan",
    "position": "Bursar",",
    "name": "Mr. L. Ramramanan",
    "page": "4",
    "section number": "1",",
    "section name": "General Information",",
    "title": "1.7 Faculty Quality Assurance Cell (FQAC)",",
    "content": "Faculty Quality Assurance Cell is functioning at the faculty level to ensure that the quality and standards of the academic programmes offered by the Faculty to meet the changing demands and challenges of higher education sector. The objective of this FQAC is to provide suggestions or recommendations and facilitation to implement and monitor the best management practices to ensure quality principles at the faculty level for an effective learning environment according to the SLQF guidelines and relevant benchmarks, student and staff support services, and other various aspects. FQAC conducts regular meetings with the members to discuss quality aspects, faculty awards and Dean’s list, conducts students’ feedback and satisfaction surveys, analyzes the results, and communicates with the appropriate staff members for verification and acceptance. Furthermore, FQAC takes a significant role in facilitating institutional and program reviews and undertakes follow-up actions on the recommendations given during the above reviews and finally reports to the Faculty Board for decision making. The meeting minutes and documentation are regularly updated on the FQAC official web- site linked to CQA and ensuring transparency, accountability, affordability, and accessibility to both staff and students, and adding value to the Faculty of Applied Science. Best prac- tices show the path to success through continuous improvement, leading to the benchmark of excellence.",",
    "page": "9",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.1The Structure of the Programme",",
    "subtitle": "2.1.1 The Title of the Degree Programme",",
    "content": "The Department of Bio-science offers a four year degree programme titled as Bachelor of Science Honours in Environmental Science. The abbreviation of Bachelor of Science Honours in Environmental Science degree is BScHons (Env Sc).",",
    "page": "11",
    "section number": "2",",
    "section name": "Degree Programme-Department of Bio Science",",
    "title": "2.1The Structure of the Programme",",
    "subtitle": "2.1.2 Admission",",
    "content": "<admission_requirements> <governing_body>University Grant Commission</governing_body> <frequency>annually</frequency> <program_type>degree programme</program_type> <minimum_requirements> <gce_al_level> <mandatory_subjects> <subject grade="S">Biology</subject> <subject grade="S">Chemistry</subject> </mandatory_subjects> <optional_subjects> <subject>Agricultural Science</subject> <subject>Higher Mathematics</subject> <subject>Mathematics</subject> <subject>Combined Mathematics</subject> <subject>Physics</subject> </optional_subjects> <note>Must achieve at least 'S' grade in one optional subject</note> </gce_al_level> </minimum_requirements> </admission_requirements>",",
    "page": "11 }, {",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.1The Structure of the Programme",",
    "subtitle": "2.1.4 Program Overview",",
    "content": "This study program is designed to offer theoretical knowledge, practical skills, problem solving, and creative thinking. The course units are distributed at four levels – Level 1, 2, 3, and 4. The proposed study program is credit based and an academic year is divided into two semesters, each with 15 weeks duration. One credit shall constitute 50 notional learning hours. Contents in a theory course may consist of one credit (50 notional learning hours), 2 credits (100 notional learning hours), and 3 credits (150 notional learning hours) while a practical course may vary from one credit (30 to 45 hours) depending on the practical knowledge required in the respective disciplines. In many course units, the practical is designed as a component along with the theory part. Students enter into the BScHons (Env Sc) are required to follow core course units in all four levels and auxiliary course units in Levels 1, 2, and 3. The most important course units to be offered in the field of Environmental Science are referred to as core course units while the elective course units are the ones chosen by the students in their field of interest. The number of credits from core course units for the four- year degree programme is 104 and the number of credits to be selected from elective course units is 16 to satisfy the total credit of 120. Level 1 Semester I has been designed to incorporate the fundamentals of Environmental Science in different disciplines of Chemistry, Botany, and Zoology in addition to Basic Math- ematics and Fundamentals of Information Technology. From Level 1 Semester II to Level 4 Semester II, the curriculum deals with the detailed study of environmental science. The curriculum in Level 4 focuses on a research project and industrial training for a period of two months. The chosen research topics of regional and national interest, mainly related to natural resources and environmental issues would help to develop their research skills and promote their in-depth knowledge in the chosen research area. Further, in order to enable students to gain knowledge on the wide range of environmental issues such as the resource exploitation, envi- ronmental disasters, environmental pollution, solid and hazardous waste disposal, wastewater discharge, deforestation, wildlife management, and unplanned urbanization, students are re- quested to prepare field report by visiting to the fields as a part of the course units. These field based assignments and the course unit titled as ‘Seminar’ facilitate Student Centered Learning (SCL) which cater the skills such as communication, teamwork, leadership, creativity, prob- lem solving, managerial and entrepreneurial, data analysis, IT applications for environmental management, social networking, adaptability, and flexibility to the undergraduates. Auxillary course units are offered to the students in Level 1, Level 2, and Level 3. In Level 1; English Language I, and Social Harmony and Active Citizenship. In Level 2; Communication and Soft skills, and English Language II. In Level 3; Career Guidance, and Management and Entrepreneurial Skills are designated as auxiliary course units. These course units are designed to impart knowledge and to develop the personality of a graduate in the field of Applied Science though they are not directly related to the field of study. The volume of learning of auxiliary course units is equivalent to 14 credits. Though all these auxiliary course units are not included in the calculation of GPA, the student should satisfy the minimum requirement as specified in the evaluation scheme to be eligible for the award of degree. The course units have gained popularity among the community as it has created a pathway to solve the environmental issues. ",",
    "page": "12",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.1The Structure of the Programme",",
    "subtitle": "2.1.5 Credit Valued Course Unit System",",
    "content": "CREDIT SYSTEM: - All course units have credit values - 1 credit = 50 notional learning hours COURSE CODE FORMAT: - Four-digit numbering system: • 1st digit: Level/year of study • 2nd digit: Semester • 3rd digit: Course unit serial number in semester • 4th digit: Credit count - See Figure 2.1 for visual details PROGRAM STRUCTURE (Section 2.1): Details how course codes organize the academic program CORE COURSE UNITS: - Purpose: Develop communication, leadership, problem-solving, IT, and managerial skills. - Design: Mostly theory + practical sessions (only one purely practical unit). - Credits: • Levels 1-3: 15 credits/semester • Level 4: - Semester I: 19 credits (choose 12 out of 17) - Semester II: 11 credits (choose 4 out of 6 electives) • Total: 120 credits AUXILIARY COURSE UNITS: - Purpose: Provide interdisciplinary knowledge. - Grading: Credits excluded from GPA but mandatory for degree. - Course List: 1. English Language I (Level 1 Sem I, 3 credits) 2. Social Harmony and Active Citizenship (Level 1 Sem II, 2 credits) 3. English Language II (Level 2 Sem I, 3 credits) 4. Communication and Soft Skills (Level 2 Sem II, 2 credits) 5. Career Guidance (Level 3 Sem I, 2 credits) 6. Management and Entrepreneurial Skills (Level 3 Sem II, 2 credits) - Reference: Table 2.1 ",",
    "page": "13",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.1 The Structure of the Programme",",
    "subtitle": "2.1.6 Volume of Learning",",
    "content": "All the students selected for this degree programme are entitled to do the four-year honours degree. Each student who follows the Honours Degree programme has to complete the mini- mum volume of learning of 120 credits of core course units and 14 credits of auxiliary course units offered during four years of study. It should be noted that Grade ‘C’ or above in the auxiliary course units English Language I and English Language II, and Grade ‘D+’ or above in the other auxiliary course units are mandatory to complete the degree programme. During Level 4 Semester II, students shall be required to carry out a research project for one semester duration on a given topic under the supervision of a senior academic in a state university or senior research staff from a reputed research institute. Students have to undergo an industrial training for two months full-time considered as one credit ",",
    "page": "14",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.1 The Structure of the Programme",",
    "subtitle": "2.1.7 Opting for General Degree",",
    "content": "During the fourth year of study, a student following an honours degree programme may opt for a general degree before the submission of the thesis of the research project with valid reason. The final acceptance to opt for the general degree will be subjected to the recommendation of the Faculty Board of Applied Sciences and the Senate. If a student wishes to complete his/her studies in three years, he/she has to complete a minimum of 90 credits of core course units and 14 credits of auxiliary course units during three years of study to obtain the degree titled Bachelor of Science in Environmental Science.",",
    "page": "14",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.2 Degree Programme Objectives and Graduate Profile",",
    "subtitle": "2.2.1 Programme Objectives",",
    "content": "ENVIRONMENTAL SCIENCE DEGREE OBJECTIVES MAIN OBJECTIVE: - Purpose: Train graduates to solve environmental problems scientifically - Focus: Prepare for industry/research needs and sustainable development - Scope: Address local to global environmental challenges SPECIFIC OBJECTIVES: 1. Understand connections between environmental systems 2. Identify environmental issues at all scales 3. Apply scientific solutions to environmental problems 4. Develop skills to assess conservation measures 5. Empower communities with environmental protection skills 6. Maintain environmental databases 7. Lead community conservation activities",",
    "page": "15",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.2Degree Programme Objectives and Graduate Profile",",
    "subtitle": "2.2.2 Graduate Profile",",
    "content": "DEPARTMENT OF BIO-SCIENCE GRADUATE PROFILE OVERVIEW: - Produces graduates committed to updated knowledge and practical skills - Equips students to apply knowledge in dynamic environments - Develops ability to critically evaluate real-world science - Fosters integrity and cross-cultural fluency for societal betterment - Provides research opportunities and independent learning - Cultivates teamwork, positive attitude, communication and leadership ENVIRONMENTAL SCIENCE GRADUATE CAPABILITIES: 1. Apply academic knowledge to scientifically solve environmental issues 2. Identify environmental problems and conduct scientific research/communication 3. Promote and ensure environmental sustainability 4. Become socially and environmentally responsible citizens",",
    "page": "16",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.1 Evaluation Methods",",
    "content": "COURSE EVALUATION SYSTEM EVALUATION METHODS: (a) In-course Assessment (ICA) - Formative - Conducted during course sessions - Includes: field assignments, assessments, viva-voce, quizzes - Mandatory attendance - Marks count toward final grade (b) End-semester Examination (ESE) - Summative - Conducted by examination branch - Held at semester end THEORY COURSES: - Final mark (M1) formula: M1 = (T × 70%) + (A1 × 30%) Where: T = ESE theory exam mark A1 = Average ICA marks PRACTICAL COURSES: - Final mark (M2) formula: M2 = (P × 60%) + (A2 × 40%) Where: P = ESE practical exam mark A2 = Average ICA marks COMBINED THEORY+PRACTICAL COURSES: - Final mark (M) formula: M = (Ct × M1 + Cp × M2)/(Ct + Cp) Where: Ct = Theory credits Cp = Practical credits - Special condition: Scoring <40% in either component results in 'E' grade (regardless of average score)",",
    "page": "17",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.1 Evaluation Methods",",
    "content": "INDUSTRIAL TRAINING EVALUATION EVALUATION PANEL: - Appointed by Head of Department - Approved by Faculty Board - Composed of: 1. Senior staff from training institution 2. Two senior staff from Bio-science Department EVALUATION CRITERIA: 1. Attendance and punctuality (10%) 2. Output and work quality (10%) 3. Reliability without supervision (5%) 4. Industriousness (5%) 5. Enthusiasm (5%) 6. Personality (5%) 7. Leadership (10%) 8. Training report preparation (30%) 9. Report presentation (10%) 10. Viva-voce (10%) TOTAL: 100%",",
    "page": "18",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.1 Evaluation Methods",",
    "content": "PROJECT EVALUATION SYSTEM EVALUATION CRITERIA: 1. Project proposal (10%) 2. Conduct of project (20%) 3. Project Report/Thesis (40%) 4. Oral presentation (15%) 5. Viva-voce (15%) EVALUATION PANEL: - Appointed by Head of Department - Recommended by Faculty Board - Approved by Senate - Composed of: 1. Supervisor (evaluates proposal and conduct - 30%) 2. Two examiners (evaluate report, presentation and viva - 70%): a) Internal: Senior department member (not supervisor) b) External: Senior academic/researcher from another institution EVALUATION WEIGHTS: - Supervisor evaluation: 30% (proposal + conduct) - Examiners evaluation: 70% (report + presentation + viva)",",
    "page": "18",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.2 Grading system and Grade Point Average (GPA)",",
    "content": "GRADING SYSTEM • A+ : 80-100 → 4.0 • A  : 75-79  → 4.0 • A- : 70-74  → 3.7 • B+ : 65-69  → 3.3 • B  : 60-64  → 3.0 • B- : 55-59  → 2.7 • C+ : 50-54  → 2.3 • C  : 45-49  → 2.0 • C- : 40-44  → 1.7 (Minimum Pass) • D+ : 35-39  → 1.3 • D  : 30-34  → 1.0 • E  : 0-29   → 0.0 (Fail) GPA Formula: (Total Credit×Grade Points) ÷ Total Credits Key Notes: 1. Minimum 40% to pass (C-) 2. E grade = Fail 3. Final GPA rounded to 2 decimals ",",
    "page": "19",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.3 Examination Process",",
    "content": "EXAMINATION SYSTEM IN-COURSE ASSESSMENTS (ICA): • Conducted during academic session • Scheduled by course lecturer • Results communicated to students • Completed during lecture periods END-SEMESTER EXAMINATIONS (ESE): • Held per faculty academic calendar • Organized by University Examination Branch • Schedule set by Dean + Department Heads • Results finalized by: 1. Faculty Pre-Exam Board 2. Senate approval 3. Dean's office display RESULT PROCESSING: 1. Exam Branch compiles all results 2. Vice-Chancellor chairs Exam Board 3. Releases: • Semester GPA • Level GPA • Final Degree Awards: - Overall GPA - Honours Classification ",",
    "page": "20",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.3 Examination Process",",
    "content": "RESIT EXAMINATION POLICY MUST RESIT IF: • Core/Elective: Grade below C- (<40) • English I/II: Grade below C (<45) • Other Auxiliary: Grade below D+ (<35) RESIT RULES: 1. Missed Exams: - Must take at next opportunity - Counts as resit attempt 2. Medical Cases: - Submit medical cert within 14 days - Approved by CMCMC + Senate - Eligible for next exam GRADING: - Keep original ICA marks - Combine with resit ESE marks STRICT POLICIES: × No ICA resits allowed × Missed ICA: - Notify lecturer immediately - Complete before ESE × No makeups after ESE ",",
    "page": "20",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.3 Examination Process",",
    "content": "EXAMINATION SYSTEM IN-COURSE ASSESSMENTS (ICA): • Conducted during academic session • Scheduled by course lecturer • Results communicated to students • Completed during lecture periods END-SEMESTER EXAMINATIONS (ESE): • Held per faculty academic calendar • Organized by University Examination Branch • Schedule set by Dean + Department Heads • Results finalized by: 1. Faculty Pre-Exam Board 2. Senate approval 3. Dean's office display RESULT PROCESSING: 1. Exam Branch compiles all results 2. Vice-Chancellor chairs Exam Board 3. Releases: • Semester GPA • Level GPA • Final Degree Awards: - Overall GPA - Honours Classification ",",
    "page": "20",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.4 Award of Degree",",
    "content": "HONOURS DEGREE REQUIREMENTS (SLQF Level 6) ELIGIBILITY CRITERIA: 1. Completion of 120 core course credits across Levels 1-4 2. Minimum grades in auxiliary courses: a) English Language I & II: Grade C or above b) Other auxiliary courses: Grade D+ or above 3. Minimum Overall GPA (OGPA): 2.00 4. Completion within maximum duration: 6 academic years DEGREE AWARD: - Bachelor of Science Honours in Environmental Science - SLQF Level 6 qualification KEY NOTES: - All core courses must be successfully completed - English language requirements are stricter (Grade C minimum) - OGPA calculation includes all academic performance - Time limit applies for degree completion ",",
    "page": "21",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.4 Award of Degree",",
    "content": "GENERAL DEGREE REQUIREMENTS (SLQF Level 5) ELIGIBILITY CRITERIA: 1. Completion of 90 core course credits across Levels 1-3 2. Minimum grades in auxiliary courses: a) English Language I & II: Grade C or above b) Other auxiliary courses: Grade D+ or above 3. Minimum OGPA (Levels 1-3): 2.00 4. Completion within maximum duration: 5 academic years DEGREE AWARD: - Bachelor of Science in Environmental Science - SLQF Level 5 qualification KEY NOTES: - Fewer credits required than Honours (90 vs 120) - English language requirements same as Honours - OGPA calculated only for Levels 1-3 - Shorter completion timeframe (5 years vs 6) ",",
    "page": "22",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.5 Award of Classes",",
    "content": "HONOURS DEGREE CLASSIFICATION FIRST CLASS REQUIREMENTS: 1. Eligibility for BSc Honours in Environmental Science 2. Minimum OGPA: 3.70 3. Completion within: 4 academic years SECOND CLASS (UPPER DIVISION) REQUIREMENTS: 1. Eligibility for BSc Honours in Environmental Science 2. Minimum OGPA: 3.30 3. Completion within: 4 academic years SECOND CLASS (LOWER DIVISION) REQUIREMENTS: 1. Eligibility for BSc Honours in Environmental Science 2. Minimum OGPA: 3.00 3. Completion within: 4 academic years DECISION AUTHORITY: - Awarded by Board of Examiners - Based on final OGPA and completion time KEY NOTES: - All classes require completion within 4 years - Class determined solely by OGPA threshold - Same base eligibility requirements apply",",
    "page": "22",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.5 Award of Classes",",
    "content": "GENERAL DEGREE CLASSIFICATION FIRST CLASS REQUIREMENTS: 1. Eligibility for BSc in Environmental Science 2. Minimum OGPA: 3.70 3. Completion within: 3 academic years SECOND CLASS (UPPER DIVISION) REQUIREMENTS: 1. Eligibility for BSc in Environmental Science 2. Minimum OGPA: 3.30 3. Completion within: 3 academic years SECOND CLASS (LOWER DIVISION) REQUIREMENTS: 1. Eligibility for BSc in Environmental Science 2. Minimum OGPA: 3.00 3. Completion within: 3 academic years DECISION AUTHORITY: - Awarded by Board of Examiners - Based on final OGPA and completion time KEY DIFFERENCES FROM HONOURS: - Shorter completion timeframe (3 years vs 4) - Lower credit requirements (90 vs 120) - Awarded for General Degree (SLQF 5)",",
    "page": "23",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.3 Evaluation System of the Degree Programme",",
    "subtitle": "2.3.6 Award of Diploma/Higher Diploma",",
    "content": "HIGHER DIPLOMA REQUIREMENTS (SLQF Level 4) ELIGIBILITY CRITERIA: 1. Completion of Levels 1 & 2 (60 core credits) 2. Minimum grades in auxiliary courses: a) ACU1113 & ACU2113: Grade C or above b) Other auxiliary courses (non-English): Grade D+ or above 3. Minimum GPA: - Level 1: 2.00 - Level 2: 2.00 AWARD: - Higher Diploma in Environmental Science - SLQF Level 4 qualification DIPLOMA REQUIREMENTS (SLQF Level 3) ELIGIBILITY CRITERIA: 1. Completion of Level 1 (30 core credits) 2. Minimum grades in auxiliary courses: a) ACU1113: Grade C or above b) Other auxiliary courses: Grade D+ or above 3. Minimum GPA: - Level 1: 2.00 AWARD: - Diploma in Environmental Science - SLQF Level 3 qualification KEY NOTES: - Early exit options from degree program - Progressive credit requirements: - Diploma: 30 credits (Level 1) - Higher Diploma: +30 credits (Level 2) - English language requirements maintained - Same minimum GPA threshold for both",",
    "page": "24",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.4 Curriculum Layout",",
    "subtitle": "Level 1",",
    "content": ",
    "page": "25",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.4 Curriculum Layout",",
    "subtitle": "Level 2 ",",
    "content": ",
    "page": "26",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.4 Curriculum Layout",",
    "subtitle": "Level 3 ",",
    "content": ",
    "page": "27",
    "section number": "2",",
    "section name": "Degree Programme – Department of Bio-science",",
    "title": "2.4 Curriculum Layout",",
    "subtitle": "Level 4 ",",
    "content": ",
    "page": "28",
}